Revit 2027 API
PointCloudColorMode Enumeration
 Color mode of a point cloud or part of a point cloud
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PointCloudColorMode
Public Enumeration PointCloudColorMode
public enum class PointCloudColorMode
type PointCloudColorMode
Members
Member name | Value | Description
Elevation | 2 |  Color by elevation
FixedColor | 1 |  Show a single color
Intensity | 3 |  Color by intensity (reflectivity)
NoOverride | 0 |  Show the actual colors
Normals | 4 |  Color by normal vectors
See Also
Reference
Autodesk.Revit.DB Namespace